//------------------------------------------------------------------------------------------------------------------
// Задача 63: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1.
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------

// Считываем даннные
int num = ReadData("Введите натуральное число:");

// Запускаем вывод
GenRecLine(num);

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------

// Метод чтения данных
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Метод печати натуральных чисел
void GenRecLine(int num)
{
    Console.Write(num + " ");
    if (num > 1)
    {
        GenRecLine(num - 1);
    }
}