//------------------------------------------------------------------------------------------------------------------
// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------

// Считываем даннные
long numM = ReadData("Введите первое число для ф-ии Аккермана:");
long numN = ReadData("Введите второе число для ф-ии Аккермана:");

// Генерируем строку со значениями
long res = CalcAckFunc(numM, numN);

// Выводим результат на экран
Console.Write("Результат ф-ции Аккермана: " + res);

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------

// Метод чтения данных
long ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Метод вычисления ф-ии Аккермана
long CalcAckFunc(long numM, long numN)
{

    if (numM == 0)
        return numN + 1;
    else
      if ((numM != 0) && (numN == 0))
        return CalcAckFunc(numM - 1, 1);
    else
        return CalcAckFunc(numM - 1, CalcAckFunc(numM, numN - 1));

}