//------------------------------------------------------------------------------------------------------------------
// Задача 67: Программа принимает целое числои и считает сумму цифр.
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------

// Считываем даннные
int num = ReadData("Введите целое число:");

// Генерируем строку со значениями
int sum = SumDigitRec(num);

// Выводим результат на экран
Console.Write("Сумма цифр: " + sum);

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------

// Метод чтения данных
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Метод геренации строки значений
int SumDigitRec(int num)
{
    return ((num > 0) ? (num % 10 + SumDigitRec(num / 10)) : 0);
}