//------------------------------------------------------------------------------------------------------------------
// Задача 65: Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------

// Считываем даннные
int numM = ReadData("Введите начало диапазона:");
int numN = ReadData("Введите конец диапазона:");

// Генерируем строку со значениями
string res = GenRecLine(numM, numN);

// Выводим результат на экран
Console.Write((numM > numN) ? GenRecLine(numN, numM) : GenRecLine(numM, numN));

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------

// Метод чтения данных
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Метод геренации строки значений
string GenRecLine(int numM, int numN)
{
    string res = string.Empty;
    if (numM <= numN)
    {
        res = numM + " " + GenRecLine(numM + 1, numN);
    }

    return res;
}