//------------------------------------------------------------------------------------------------------------------
// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30
//------------------------------------------------------------------------------------------------------------------

//                                                 Тело программы
//------------------------------------------------------------------------------------------------------------------

// Считываем даннные
int numM = ReadData("Введите начало диапазона:");
int numN = ReadData("Введите конец диапазона:");

// Генерируем строку со значениями
long res = SumNaturals(numM, numN);

// Выводим результат на экран
Console.Write("Сумма натуральных чисел в диапазоне: " + ((numM > numN) ? SumNaturals(numN, numM) : SumNaturals(numM, numN)));

//                                                     Методы
//------------------------------------------------------------------------------------------------------------------

// Метод чтения данных
int ReadData(string msg)
{
    Console.WriteLine(msg);
    int num = int.Parse(Console.ReadLine() ?? "0");
    return num;
}

// Метод геренации строки значений
long SumNaturals(int numM, int numN)
{
    long sum = 0;
    if (numM <= numN)
    {
        sum += numM + SumNaturals(numM + 1, numN);
    }
    return sum;
}